package by.bsu.orienteering.service;

import by.bsu.orienteering.model.PersonResult;
import by.bsu.orienteering.model.Source;
import by.bsu.orienteering.parser.IParser;

import java.util.List;

/**
 * Created by alexey.memelov on 21-Dec-18.
 */
public class SFRParserTest {

    private static String test =
                    "\t\t1\t231\tЖУРАВЛЕВА\tТАТЬЯНА\t1986\tмс\tСКО \"Немига-Норд\"\t\t00:47:35\t1\t\tмс\t-\n" +
                            "2\t277\tГРИШАНОВА\tНАТАЛЬЯ\t1989\tмс\tКСО \"Эридан\"\t\t00:48:00\t2\t+0:25\tмс\t-\n" +
                            "3\t112\tВОСКОБОЙНИКОВА\tТАТЬЯНА\t1980\tмс\tКО \"Белая Русь\"\t\t00:48:08\t3\t+0:33\tмс\t-\n" +
                            "4\t131\tСАПРОНЕНКОВА\tЛЮДМИЛА\t1982\tмс\tВитязь-Rus\tв/к\t00:48:51\t-\t+1:16\t-\t-\n" +
                            "5\t133\tЦВИРБУТ\tЮЛИЯ\t1992\tкмс\tг. Минск\t\t00:50:34\t4\t+2:59\tкмс\t100\n" +
                            "6\t136\tЯКУБКИНА\tКРИСТИНА\t1992\tмс\tг. Минск\t\t00:50:41\t5\t+3:06\tкмс\t97\n" +
                            "7\t122\tСКИНДЕР\tЛЮДМИЛА\t1980\tкмс\tБрестская обл.\t\t00:52:05\t6\t+4:30\tкмс\t94\n" +
                            "8\t153\tЛАПИЦКАЯ\tИРИНА\t1988\tкмс\tГомельская область\t\t00:52:35\t7\t+5:00\tкмс\t91\n" +
                            "9\t257\tМАЛЬЧЕНКОВА\tАНАСТАСИЯ\t1997\tкмс\tСмоленск-RUS\tв/к\t00:53:04\t-\t+5:29\t-\t-\n" +
                            "10\t139\tМОЖАР\tВИКТОРИЯ\t1996\tкмс\tг. Минск\t\t00:55:35\t8\t+8:00\tкмс\t89\n" +
                            "11\t204\tРЕБРОВА\tЕЛЕНА\t1990\t1р\tЛИЧНО\t\t00:58:22\t9\t+10:47\t1р\t-\n" +
                            "12\t140\tКРЮКОВА\tНАТАЛЬЯ\t1988\tмс\tг. Минск\t\t01:00:56\t10\t+13:21\t1р\t87\n" +
                            "13\t184\tПИТИРИМОВА\tЕЛЕНА\t1990\tкмс\tСК \"Камволь\"\tв/к\t01:01:09\t-\t+13:34\t-\t-\n" +
                            "14\t232\tЖУРАВЛЁВА\tОКСАНА\t1980\tкмс\tСКО \"Немига-Норд\"\t\t01:02:27\t11\t+14:52\t1р\t-\n" +
                            "15\t228\tПОЛЕКШАНОВА\tДАРЬЯ\t1977\tкмс\tСКО \"Немига-Норд\"\t\t01:04:18\t12\t+16:43\t2р\t-\n" +
                            "16\t221\tСМИРНОВА\tМАРИНА\t1994\tкмс\tМогилевская область\t\t01:06:15\t13\t+18:40\t2р\t85\n" +
                            "17\t209\tПАКНИС\tМАРИНА\t1994\tкмс\tМогилевская область\t\t01:06:37\t14\t+19:02\t2р\t83\n" +
                            "18\t164\tБОВШЕВИЧ\tАННА\t1986\tкмс\tГродненская область\t\t01:06:40\t15\t+19:05\t2р\t81\n" +
                            "19\t220\tБУЯКОВА\tОКСАНА\t1991\tмс\tМогилевская область\t\t01:09:45\t16\t+22:10\t2р\t80\n" +
                            "20\t183\tКАЛИНИЧЕНКО\tАННА\t1987\tкмс\tСК \"Камволь\"\tв/к\t01:12:51\t-\t+25:16\t-\t-\n" +
                            "21\t182\tКРЫМЦЕВА\tАЛИНА\t1995\tкмс\tСК \"Камволь\"\tв/к\t01:13:58\t-\t+26:23\t-\t-\n" +
                            "22\t216\tСАМОЛАЗОВА\tАЛЕКСАНДРА\t1993\tмс\tМогилевская область\t\t01:14:55\t17\t+27:20\t3р\t79\n" +
                            "23\t208\tРОГОВЦОВА\tОЛЬГА\t1987\tмс\tМогилевская область\t\tcнят\t\t";




    public static void main(String[] args) {
        IParser parser = ParserFactory.getInstance(Source.SFR);
        List<PersonResult> personResults = parser.parseResults(test);
        System.out.println(personResults.size());
    }



}
